Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ1064DAS169.atdf
            <instance name="OCMP3">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 4"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 5"/>
                 </parameters>
            </instance>
            <instance name="OCMP4">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 3"/>
                </parameters>
            </instance>
            <instance name="OCMP5">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 3"/>
                </parameters>
            </instance>
            <instance name="OCMP6">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 3"/>
                </parameters>
            </instance>
            <instance name="OCMP7">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 6"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 7"/>
                </parameters>
            </instance>
            <instance name="OCMP8">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 6"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 7"/>
                </parameters>
            </instance>
            <instance name="OCMP9">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 6"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 7"/>
                </parameters>
            </instance>
         </module>
         <module id="01643" name="PCACHE" version="">
            <instance name="PCACHE">
               <register-group address-space="periph_indep" name="PCACHE" name-in-module="PCACHE" offset="0x1f8e0000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00751" name="PMP" version="">
            <instance name="PMP">
               <register-group address-space="periph_pb2_std" name="PMP" name-in-module="PMP" offset="0x1f82e000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00159" name="RNG" version="">
            <instance name="RNG">
               <register-group address-space="periph_indep" name="RNG" name-in-module="RNG" offset="0x1f8e6000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01423" name="RPIN" version="">
            <instance name="RPIN">
               <register-group address-space="periph_pb1_std" name="RPIN" name-in-module="RPIN" offset="0x1f801404" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01423" name="RPOUT" version="">
            <instance name="RPOUT">
               <register-group address-space="periph_pb1_std" name="RPOUT" name-in-module="RPOUT" offset="0x1f801538" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01261" name="RTCC" version="">
            <instance name="RTCC">
               <register-group address-space="periph_pb6_std" name="RTCC" name-in-module="RTCC" offset="0x1f8c0000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00136" name="SB" version="">
            <instance name="SB">
               <register-group address-space="periph_ssx0" name="SB" name-in-module="SB" offset="0x1f8f8020" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00187" name="SDHC" version="">
            <instance name="SDHC">
               <register-group address-space="periph_indep" name="SDHC" name-in-module="SDHC" offset="0x1f8ec004" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01329" name="SPI" version="">
            <instance name="SPI1">
               <register-group address-space="periph_pb2_std" name="SPI" name-in-module="SPI" offset="0x1f821000"/>
               <parameters>
                  <param name=""/>
               </parameters>
           </instance>
            <instance name="SPI2"/>
            <instance name="SPI3"/>
            <instance name="SPI4"/>
            <instance name="SPI5"/>
            <instance name="SPI6"/>
         </module>
         <module id="00206" name="SQI" version="">
            <instance name="SQI1">
               <register-group address-space="periph_indep" name="SQI" name-in-module="SQI" offset="0x1f8e2000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
