Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ1064DAS169.atdf
      <value-group caption="Graphics Display Mode bit" name="CFGCON2__GLCDMODE">
         <value caption="GLCD pins are set to RGB565 mode. Other GDx pins are available for general purpose use." name="" value="0x1" />
         <value caption="GLCD pins are set to RGB888 mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Graphics Display Pin Enable bit" name="CFGCON2__GLCDPINEN">
         <value caption="GLCD pins are used by the GLCD module" name="" value="0x1" />
         <value caption="GLCD pins are available for general purpose use" name="" value="0x0" />
      </value-group>
      <value-group caption="MPLL Input Divider bits" name="CFGMPLL__MPLLIDIV">
         <value caption="MPLL input clock is divider by 63" name="DIV_63" value="0x3f" />
         <value caption="MPLL input clock is divider by 62" name="DIV_62" value="0x3e" />
         <value caption="MPLL input clock is divider by 61" name="DIV_61" value="0x3D" />
         <value caption="MPLL input clock is divider by 60" name="DIV_60" value="0x3C" />
         <value caption="MPLL input clock is divider by 59" name="DIV_59" value="0x3B" />
         <value caption="MPLL input clock is divider by 58" name="DIV_58" value="0x3A" />
         <value caption="MPLL input clock is divider by 57" name="DIV_57" value="0x39" />
         <value caption="MPLL input clock is divider by 56" name="DIV_56" value="0x38" />
         <value caption="MPLL input clock is divider by 55" name="DIV_55" value="0x37" />
         <value caption="MPLL input clock is divider by 54" name="DIV_54" value="0x36" />
         <value caption="MPLL input clock is divider by 53" name="DIV_53" value="0x35" />
         <value caption="MPLL input clock is divider by 52" name="DIV_52" value="0x34" />
         <value caption="MPLL input clock is divider by 51" name="DIV_51" value="0x33" />
         <value caption="MPLL input clock is divider by 50" name="DIV_50" value="0x32" />
         <value caption="MPLL input clock is divider by 49" name="DIV_49" value="0x31" />
         <value caption="MPLL input clock is divider by 48" name="DIV_48" value="0x30" />
         <value caption="MPLL input clock is divider by 47" name="DIV_47" value="0x2F" />
         <value caption="MPLL input clock is divider by 46" name="DIV_46" value="0x2E" />
         <value caption="MPLL input clock is divider by 45" name="DIV_45" value="0x2D" />
         <value caption="MPLL input clock is divider by 44" name="DIV_44" value="0x2C" />
         <value caption="MPLL input clock is divider by 43" name="DIV_43" value="0x2B" />
         <value caption="MPLL input clock is divider by 42" name="DIV_42" value="0x2A" />
         <value caption="MPLL input clock is divider by 41" name="DIV_41" value="0x29" />
         <value caption="MPLL input clock is divider by 40" name="DIV_40" value="0x28" />
         <value caption="MPLL input clock is divider by 39" name="DIV_39" value="0x27" />
         <value caption="MPLL input clock is divider by 38" name="DIV_38" value="0x26" />
         <value caption="MPLL input clock is divider by 37" name="DIV_37" value="0x25" />
         <value caption="MPLL input clock is divider by 36" name="DIV_36" value="0x24" />
         <value caption="MPLL input clock is divider by 35" name="DIV_35" value="0x23" />
         <value caption="MPLL input clock is divider by 34" name="DIV_34" value="0x22" />
         <value caption="MPLL input clock is divider by 33" name="DIV_33" value="0x21" />
         <value caption="MPLL input clock is divider by 32" name="DIV_32" value="0x20" />
         <value caption="MPLL input clock is divider by 31" name="DIV_31" value="0x1F" />
         <value caption="MPLL input clock is divider by 30" name="DIV_30" value="0x1E" />
         <value caption="MPLL input clock is divider by 29" name="DIV_29" value="0x1D" />
         <value caption="MPLL input clock is divider by 28" name="DIV_28" value="0x1C" />
         <value caption="MPLL input clock is divider by 27" name="DIV_27" value="0x1B" />
         <value caption="MPLL input clock is divider by 26" name="DIV_26" value="0x1A" />
         <value caption="MPLL input clock is divider by 25" name="DIV_25" value="0x19" />
         <value caption="MPLL input clock is divider by 24" name="DIV_24" value="0x18" />
         <value caption="MPLL input clock is divider by 23" name="DIV_23" value="0x17" />
         <value caption="MPLL input clock is divider by 22" name="DIV_22" value="0x16" />
         <value caption="MPLL input clock is divider by 21" name="DIV_21" value="0x15" />
         <value caption="MPLL input clock is divider by 20" name="DIV_20" value="0x14" />
         <value caption="MPLL input clock is divider by 19" name="DIV_19" value="0x13" />
         <value caption="MPLL input clock is divider by 18" name="DIV_18" value="0x12" />
         <value caption="MPLL input clock is divider by 17" name="DIV_17" value="0x11" />
         <value caption="MPLL input clock is divider by 16" name="DIV_16" value="0x10" />
         <value caption="MPLL input clock is divider by 15" name="DIV_15" value="0xF" />
         <value caption="MPLL input clock is divider by 14" name="DIV_14" value="0xE" />
         <value caption="MPLL input clock is divider by 13" name="DIV_13" value="0xD" />
         <value caption="MPLL input clock is divider by 12" name="DIV_12" value="0xC" />
         <value caption="MPLL input clock is divider by 11" name="DIV_11" value="0xB" />
         <value caption="MPLL input clock is divider by 10" name="DIV_10" value="0xA" />
         <value caption="MPLL input clock is divider by 9" name="DIV_9" value="0x9" />
         <value caption="MPLL input clock is divider by 8" name="DIV_8" value="0x8" />
         <value caption="MPLL input clock is divider by 7" name="DIV_7" value="0x7" />
         <value caption="MPLL input clock is divider by 6" name="DIV_6" value="0x6" />
         <value caption="MPLL input clock is divider by 5" name="DIV_5" value="0x5" />
         <value caption="MPLL input clock is divider by 4" name="DIV_4" value="0x4" />
         <value caption="MPLL input clock is divider by 3" name="DIV_3" value="0x3" />
         <value caption="MPLL input clock is divider by 2" name="DIV_2" value="0x2" />
         <value caption="MPLL input clock is divider by 1" name="DIV_1" value="0x1" />
         <value caption="Reserved" name="RESERVED" value="0x0" />
      </value-group>
