Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ1064DAS169.atdf
         <register caption="DDR Host Command 1 Register x (x = 0 through 15)" name="DDRCMD17" offset="0x9c" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CLKENCMD1" />
            <bitfield mask="0x000001FE" name="CSCMD1" />
            <bitfield mask="0x00000200" name="RASCMD1" />
            <bitfield mask="0x00000400" name="CASCMD1" />
            <bitfield mask="0x00000800" name="WENCMD1" />
            <bitfield mask="0x00001000" name="CLKENCMD2" />
            <bitfield mask="0x001FE000" name="CSCMD2" />
            <bitfield mask="0x00200000" name="RASCMD2" />
            <bitfield mask="0x00400000" name="CASCMD2" />
            <bitfield mask="0x00800000" name="WENCMD2" />
            <bitfield mask="0xFF000000" name="MDALCMD" />
         </register>
         <register caption="DDR Host Command 1 Register x (x = 0 through 15)" name="DDRCMD18" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CLKENCMD1" />
            <bitfield mask="0x000001FE" name="CSCMD1" />
            <bitfield mask="0x00000200" name="RASCMD1" />
            <bitfield mask="0x00000400" name="CASCMD1" />
            <bitfield mask="0x00000800" name="WENCMD1" />
            <bitfield mask="0x00001000" name="CLKENCMD2" />
            <bitfield mask="0x001FE000" name="CSCMD2" />
            <bitfield mask="0x00200000" name="RASCMD2" />
            <bitfield mask="0x00400000" name="CASCMD2" />
            <bitfield mask="0x00800000" name="WENCMD2" />
            <bitfield mask="0xFF000000" name="MDALCMD" />
         </register>
         <register caption="DDR Host Command 1 Register x (x = 0 through 15)" name="DDRCMD19" offset="0xa4" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CLKENCMD1" />
            <bitfield mask="0x000001FE" name="CSCMD1" />
            <bitfield mask="0x00000200" name="RASCMD1" />
            <bitfield mask="0x00000400" name="CASCMD1" />
            <bitfield mask="0x00000800" name="WENCMD1" />
            <bitfield mask="0x00001000" name="CLKENCMD2" />
            <bitfield mask="0x001FE000" name="CSCMD2" />
            <bitfield mask="0x00200000" name="RASCMD2" />
            <bitfield mask="0x00400000" name="CASCMD2" />
            <bitfield mask="0x00800000" name="WENCMD2" />
            <bitfield mask="0xFF000000" name="MDALCMD" />
         </register>
         <register caption="DDR Host Command 1 Register x (x = 0 through 15)" name="DDRCMD110" offset="0xa8" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CLKENCMD1" />
            <bitfield mask="0x000001FE" name="CSCMD1" />
            <bitfield mask="0x00000200" name="RASCMD1" />
            <bitfield mask="0x00000400" name="CASCMD1" />
            <bitfield mask="0x00000800" name="WENCMD1" />
            <bitfield mask="0x00001000" name="CLKENCMD2" />
            <bitfield mask="0x001FE000" name="CSCMD2" />
            <bitfield mask="0x00200000" name="RASCMD2" />
            <bitfield mask="0x00400000" name="CASCMD2" />
            <bitfield mask="0x00800000" name="WENCMD2" />
            <bitfield mask="0xFF000000" name="MDALCMD" />
         </register>
         <register caption="DDR Host Command 1 Register x (x = 0 through 15)" name="DDRCMD111" offset="0xac" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CLKENCMD1" />
            <bitfield mask="0x000001FE" name="CSCMD1" />
            <bitfield mask="0x00000200" name="RASCMD1" />
            <bitfield mask="0x00000400" name="CASCMD1" />
            <bitfield mask="0x00000800" name="WENCMD1" />
            <bitfield mask="0x00001000" name="CLKENCMD2" />
            <bitfield mask="0x001FE000" name="CSCMD2" />
            <bitfield mask="0x00200000" name="RASCMD2" />
            <bitfield mask="0x00400000" name="CASCMD2" />
            <bitfield mask="0x00800000" name="WENCMD2" />
            <bitfield mask="0xFF000000" name="MDALCMD" />
         </register>
         <register caption="DDR Host Command 1 Register x (x = 0 through 15)" name="DDRCMD112" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CLKENCMD1" />
            <bitfield mask="0x000001FE" name="CSCMD1" />
            <bitfield mask="0x00000200" name="RASCMD1" />
            <bitfield mask="0x00000400" name="CASCMD1" />
            <bitfield mask="0x00000800" name="WENCMD1" />
            <bitfield mask="0x00001000" name="CLKENCMD2" />
            <bitfield mask="0x001FE000" name="CSCMD2" />
            <bitfield mask="0x00200000" name="RASCMD2" />
            <bitfield mask="0x00400000" name="CASCMD2" />
            <bitfield mask="0x00800000" name="WENCMD2" />
            <bitfield mask="0xFF000000" name="MDALCMD" />
         </register>
         <register caption="DDR Host Command 1 Register x (x = 0 through 15)" name="DDRCMD113" offset="0xb4" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CLKENCMD1" />
            <bitfield mask="0x000001FE" name="CSCMD1" />
            <bitfield mask="0x00000200" name="RASCMD1" />
            <bitfield mask="0x00000400" name="CASCMD1" />
            <bitfield mask="0x00000800" name="WENCMD1" />
            <bitfield mask="0x00001000" name="CLKENCMD2" />
            <bitfield mask="0x001FE000" name="CSCMD2" />
            <bitfield mask="0x00200000" name="RASCMD2" />
            <bitfield mask="0x00400000" name="CASCMD2" />
            <bitfield mask="0x00800000" name="WENCMD2" />
            <bitfield mask="0xFF000000" name="MDALCMD" />
         </register>
         <register caption="DDR Host Command 1 Register x (x = 0 through 15)" name="DDRCMD114" offset="0xb8" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CLKENCMD1" />
            <bitfield mask="0x000001FE" name="CSCMD1" />
            <bitfield mask="0x00000200" name="RASCMD1" />
            <bitfield mask="0x00000400" name="CASCMD1" />
            <bitfield mask="0x00000800" name="WENCMD1" />
            <bitfield mask="0x00001000" name="CLKENCMD2" />
            <bitfield mask="0x001FE000" name="CSCMD2" />
            <bitfield mask="0x00200000" name="RASCMD2" />
            <bitfield mask="0x00400000" name="CASCMD2" />
            <bitfield mask="0x00800000" name="WENCMD2" />
            <bitfield mask="0xFF000000" name="MDALCMD" />
         </register>
         <register caption="DDR Host Command 1 Register x (x = 0 through 15)" name="DDRCMD115" offset="0xbc" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CLKENCMD1" />
            <bitfield mask="0x000001FE" name="CSCMD1" />
            <bitfield mask="0x00000200" name="RASCMD1" />
            <bitfield mask="0x00000400" name="CASCMD1" />
            <bitfield mask="0x00000800" name="WENCMD1" />
            <bitfield mask="0x00001000" name="CLKENCMD2" />
            <bitfield mask="0x001FE000" name="CSCMD2" />
            <bitfield mask="0x00200000" name="RASCMD2" />
            <bitfield mask="0x00400000" name="CASCMD2" />
            <bitfield mask="0x00800000" name="WENCMD2" />
            <bitfield mask="0xFF000000" name="MDALCMD" />
         </register>
         <register caption="DDR Host Command 2 Register x (x = 0 through 15)" name="DDRCMD20" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MDADDRHCMD" />
            <bitfield mask="0x00000700" name="BNKADDRCMD" />
            <bitfield mask="0x000FF800" name="WAIT" />
         </register>
