Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ1064DAS169.atdf
         <register caption="" name="GLCDCURDATA17" offset="0x844" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL415" />
            <bitfield mask="0x000000F0" name="PIXEL414" />
            <bitfield mask="0x00000F00" name="PIXEL413" />
            <bitfield mask="0x0000F000" name="PIXEL412" />
            <bitfield mask="0x000F0000" name="PIXEL411" />
            <bitfield mask="0x00F00000" name="PIXEL410" />
            <bitfield mask="0x0F000000" name="PIXEL49" />
            <bitfield mask="0xF0000000" name="PIXEL48" />
         </register>
         <register caption="" name="GLCDCURDATA18" offset="0x848" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL423" />
            <bitfield mask="0x000000F0" name="PIXEL422" />
            <bitfield mask="0x00000F00" name="PIXEL421" />
            <bitfield mask="0x0000F000" name="PIXEL420" />
            <bitfield mask="0x000F0000" name="PIXEL419" />
            <bitfield mask="0x00F00000" name="PIXEL418" />
            <bitfield mask="0x0F000000" name="PIXEL417" />
            <bitfield mask="0xF0000000" name="PIXEL416" />
         </register>
         <register caption="" name="GLCDCURDATA19" offset="0x84C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL431" />
            <bitfield mask="0x000000F0" name="PIXEL430" />
            <bitfield mask="0x00000F00" name="PIXEL429" />
            <bitfield mask="0x0000F000" name="PIXEL428" />
            <bitfield mask="0x000F0000" name="PIXEL427" />
            <bitfield mask="0x00F00000" name="PIXEL426" />
            <bitfield mask="0x0F000000" name="PIXEL425" />
            <bitfield mask="0xF0000000" name="PIXEL424" />
         </register>
         <register caption="" name="GLCDCURDATA20" offset="0x850" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL57" />
            <bitfield mask="0x000000F0" name="PIXEL56" />
            <bitfield mask="0x00000F00" name="PIXEL55" />
            <bitfield mask="0x0000F000" name="PIXEL54" />
            <bitfield mask="0x000F0000" name="PIXEL53" />
            <bitfield mask="0x00F00000" name="PIXEL52" />
            <bitfield mask="0x0F000000" name="PIXEL51" />
            <bitfield mask="0xF0000000" name="PIXEL50" />
         </register>
         <register caption="" name="GLCDCURDATA21" offset="0x854" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL515" />
            <bitfield mask="0x000000F0" name="PIXEL514" />
            <bitfield mask="0x00000F00" name="PIXEL513" />
            <bitfield mask="0x0000F000" name="PIXEL512" />
            <bitfield mask="0x000F0000" name="PIXEL511" />
            <bitfield mask="0x00F00000" name="PIXEL510" />
            <bitfield mask="0x0F000000" name="PIXEL59" />
            <bitfield mask="0xF0000000" name="PIXEL58" />
         </register>
         <register caption="" name="GLCDCURDATA22" offset="0x858" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL523" />
            <bitfield mask="0x000000F0" name="PIXEL522" />
            <bitfield mask="0x00000F00" name="PIXEL521" />
            <bitfield mask="0x0000F000" name="PIXEL520" />
            <bitfield mask="0x000F0000" name="PIXEL519" />
            <bitfield mask="0x00F00000" name="PIXEL518" />
            <bitfield mask="0x0F000000" name="PIXEL517" />
            <bitfield mask="0xF0000000" name="PIXEL516" />
         </register>
         <register caption="" name="GLCDCURDATA23" offset="0x85C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL531" />
            <bitfield mask="0x000000F0" name="PIXEL530" />
            <bitfield mask="0x00000F00" name="PIXEL529" />
            <bitfield mask="0x0000F000" name="PIXEL528" />
            <bitfield mask="0x000F0000" name="PIXEL527" />
            <bitfield mask="0x00F00000" name="PIXEL526" />
            <bitfield mask="0x0F000000" name="PIXEL525" />
            <bitfield mask="0xF0000000" name="PIXEL524" />
         </register>
         <register caption="" name="GLCDCURDATA24" offset="0x860" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL67" />
            <bitfield mask="0x000000F0" name="PIXEL66" />
            <bitfield mask="0x00000F00" name="PIXEL65" />
            <bitfield mask="0x0000F000" name="PIXEL64" />
            <bitfield mask="0x000F0000" name="PIXEL63" />
            <bitfield mask="0x00F00000" name="PIXEL62" />
            <bitfield mask="0x0F000000" name="PIXEL61" />
            <bitfield mask="0xF0000000" name="PIXEL60" />
         </register>
         <register caption="" name="GLCDCURDATA25" offset="0x864" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL615" />
            <bitfield mask="0x000000F0" name="PIXEL614" />
            <bitfield mask="0x00000F00" name="PIXEL613" />
            <bitfield mask="0x0000F000" name="PIXEL612" />
            <bitfield mask="0x000F0000" name="PIXEL611" />
            <bitfield mask="0x00F00000" name="PIXEL610" />
            <bitfield mask="0x0F000000" name="PIXEL69" />
            <bitfield mask="0xF0000000" name="PIXEL68" />
         </register>
         <register caption="" name="GLCDCURDATA26" offset="0x868" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL623" />
            <bitfield mask="0x000000F0" name="PIXEL622" />
            <bitfield mask="0x00000F00" name="PIXEL621" />
            <bitfield mask="0x0000F000" name="PIXEL620" />
            <bitfield mask="0x000F0000" name="PIXEL619" />
            <bitfield mask="0x00F00000" name="PIXEL618" />
            <bitfield mask="0x0F000000" name="PIXEL617" />
            <bitfield mask="0xF0000000" name="PIXEL616" />
         </register>
         <register caption="" name="GLCDCURDATA27" offset="0x86C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL631" />
            <bitfield mask="0x000000F0" name="PIXEL630" />
            <bitfield mask="0x00000F00" name="PIXEL629" />
            <bitfield mask="0x0000F000" name="PIXEL628" />
            <bitfield mask="0x000F0000" name="PIXEL627" />
            <bitfield mask="0x00F00000" name="PIXEL626" />
            <bitfield mask="0x0F000000" name="PIXEL625" />
            <bitfield mask="0xF0000000" name="PIXEL624" />
         </register>
         <register caption="" name="GLCDCURDATA28" offset="0x870" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL77" />
            <bitfield mask="0x000000F0" name="PIXEL76" />
            <bitfield mask="0x00000F00" name="PIXEL75" />
            <bitfield mask="0x0000F000" name="PIXEL74" />
            <bitfield mask="0x000F0000" name="PIXEL73" />
            <bitfield mask="0x00F00000" name="PIXEL72" />
            <bitfield mask="0x0F000000" name="PIXEL71" />
            <bitfield mask="0xF0000000" name="PIXEL70" />
         </register>
         <register caption="" name="GLCDCURDATA29" offset="0x874" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL715" />
            <bitfield mask="0x000000F0" name="PIXEL714" />
            <bitfield mask="0x00000F00" name="PIXEL713" />
            <bitfield mask="0x0000F000" name="PIXEL712" />
            <bitfield mask="0x000F0000" name="PIXEL711" />
            <bitfield mask="0x00F00000" name="PIXEL710" />
            <bitfield mask="0x0F000000" name="PIXEL79" />
            <bitfield mask="0xF0000000" name="PIXEL78" />
         </register>
