Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ1064DAS169.atdf
      <value-group caption="Formatting Clock Divide Enable bit" name="GLCDMODE__FORMATCLK">
         <value caption="Formatting clock is not divided" name="" value="0x1" />
         <value caption="Formatting clock is divided" name="" value="0x0" />
      </value-group>
      <value-group caption="YUV Output Enable bit" name="GLCDMODE__YUVOUTPUT">
         <value caption="YUV is enabled" name="" value="0x1" />
         <value caption="RGB is enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Force Output to Blank bit" name="GLCDMODE__FORCEBLANK">
         <value caption="Forces output to blank" name="" value="0x1" />
         <value caption="No effect" name="" value="0x0" />
      </value-group>
      <value-group caption="Palette Gamma Ramp Enable bit" name="GLCDMODE__PGRAMPEN">
         <value caption="Palette gamma ramp is enabled" name="" value="0x1" />
         <value caption="Palette gamma ramp is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Pixel Clock Out Polarity bit" name="GLCDMODE__PCLKPOL">
         <value caption="Pixel clock out polarity is negative" name="" value="0x1" />
         <value caption="Pixel clock out polarity is positive" name="" value="0x0" />
      </value-group>
      <value-group caption="Vertical Sync for Single Cycle Per Line Enable bit" name="GLCDMODE__VSYNCCYC">
         <value caption="VSYNC for a single cycle per line is enabled" name="" value="0x1" />
         <value caption="VSYNC for a single cycle per line is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Dithering Enable bit" name="GLCDMODE__DITHER">
         <value caption="Dithering is enabled" name="" value="0x1" />
         <value caption="Dithering is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="DE Polarity bit" name="GLCDMODE__DEPOL">
         <value caption="DE polarity is negative" name="" value="0x1" />
         <value caption="DE polarity is positive" name="" value="0x0" />
      </value-group>
      <value-group caption="Horizontal Sync Polarity bit" name="GLCDMODE__HSYNCPOL">
         <value caption="HSYNC polarity is negative" name="" value="0x1" />
         <value caption="HSYNC polarity is positive" name="" value="0x0" />
      </value-group>
      <value-group caption="Vertical Sync Polarity bit" name="GLCDMODE__VSYNCPOL">
         <value caption="VSYNC polarity is negative" name="" value="0x1" />
         <value caption="VSYNC polarity is positive" name="" value="0x0" />
      </value-group>
      <value-group caption="Programmable Cursor Enable bit" name="GLCDMODE__CURSOREN">
         <value caption="Programmable cursor is enabled" name="" value="0x1" />
         <value caption="Programmable cursor is enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="LCD Controller Module Enable bit" name="GLCDMODE__LCDEN">
         <value caption="LCD Controller module is enabled" name="" value="0x1" />
         <value caption="LCD Controller module is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Divider bits" name="GLCDCLKCON__CLKDIV">
         <value caption="Reserved" name="" value="0x3f" />
         <value caption="Reserved" name="" value="0x3e" />
         <value caption="Divided by 31" name="" value="0x1f" />
         <value caption="Divided by 30" name="" value="0x1e" />
         <value caption="Divided by 29" name="" value="0x1d" />
         <value caption="Divided by 3" name="" value="0x3" />
         <value caption="Divided by 2" name="" value="0x2" />
         <value caption="Divided by 1" name="" value="0x1" />
         <value caption="Divided by 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Color Mode bits" name="GLCDL0MODE__COLORMODE">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="RGB888 color format" name="" value="0xb" />
         <value caption="YUYV color format" name="" value="0xa" />
         <value caption="L4 gray scale/palette format" name="" value="0x9" />
         <value caption="L1 gray scale/palette format" name="" value="0x8" />
         <value caption="L8 gray scale/palette format" name="" value="0x7" />
         <value caption="32-bit ARGB8888 color format" name="" value="0x6" />
         <value caption="16-bit RGB565 color format" name="" value="0x5" />
         <value caption="8-bit RGB332 color format" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="32-bit RGBA8888 color format" name="" value="0x2" />
         <value caption="16-bit RGBA5551 color format" name="" value="0x1" />
         <value caption="8-bit color palette look-up table (LUT8)" name="" value="0x0" />
      </value-group>
      <value-group caption="Source Blending Function bits" name="GLCDL0MODE__SRCBLEND">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Blend inverted destination" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Blend alpha destination" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Blend inverted source and inverted global" name="" value="0x7" />
         <value caption="Blend inverted global" name="" value="0x6" />
         <value caption="Blend inverted source" name="" value="0x5" />
         <value caption="Blend alpha source and alpha global" name="" value="0x4" />
         <value caption="Blend alpha global" name="" value="0x3" />
         <value caption="Blend alpha source" name="" value="0x2" />
         <value caption="Blend white" name="" value="0x1" />
         <value caption="Blend black" name="" value="0x0" />
      </value-group>
      <value-group caption="Destinary Blending Function bits" name="GLCDL0MODE__DESTBLEND">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Blend inverted destination" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Blend alpha destination" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Blend inverted source and inverted global" name="" value="0x7" />
         <value caption="Blend inverted global" name="" value="0x6" />
         <value caption="Blend inverted source" name="" value="0x5" />
         <value caption="Blend alpha source and alpha global" name="" value="0x4" />
         <value caption="Blend alpha global" name="" value="0x3" />
         <value caption="Blend alpha source" name="" value="0x2" />
         <value caption="Blend white" name="" value="0x1" />
         <value caption="Blend black" name="" value="0x0" />
      </value-group>
