Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ1064DAS169.atdf
      <value-group caption="Premultiply Image Alpha bit" name="GLCDL0MODE__MULALPHA">
         <value caption="Premultiply image alpha is enabled" name="" value="0x1" />
         <value caption="Premultiply image alpha is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Force Alpha with Global Alpha bit" name="GLCDL0MODE__FORCEALPHA">
         <value caption="Force alpha with global alpha is enabled" name="" value="0x1" />
         <value caption="Force alpha with global alpha is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Disable Bilinear Filtering bit" name="GLCDL0MODE__DISABIFIL">
         <value caption="Bilinear filtering is enabled" name="" value="0x1" />
         <value caption="Bilinear filtering is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Layer Enable bit" name="GLCDL0MODE__LAYEREN">
         <value caption="Layer is enabled" name="" value="0x1" />
         <value caption="Layer is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Color Mode bits" name="GLCDL1MODE__COLORMODE">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="RGB888 color format" name="" value="0xb" />
         <value caption="YUYV color format" name="" value="0xa" />
         <value caption="L4 gray scale/palette format" name="" value="0x9" />
         <value caption="L1 gray scale/palette format" name="" value="0x8" />
         <value caption="L8 gray scale/palette format" name="" value="0x7" />
         <value caption="32-bit ARGB8888 color format" name="" value="0x6" />
         <value caption="16-bit RGB565 color format" name="" value="0x5" />
         <value caption="8-bit RGB332 color format" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="32-bit RGBA8888 color format" name="" value="0x2" />
         <value caption="16-bit RGBA5551 color format" name="" value="0x1" />
         <value caption="8-bit color palette look-up table (LUT8)" name="" value="0x0" />
      </value-group>
      <value-group caption="Source Blending Function bits" name="GLCDL1MODE__SRCBLEND">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Blend inverted destination" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Blend alpha destination" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Blend inverted source and inverted global" name="" value="0x7" />
         <value caption="Blend inverted global" name="" value="0x6" />
         <value caption="Blend inverted source" name="" value="0x5" />
         <value caption="Blend alpha source and alpha global" name="" value="0x4" />
         <value caption="Blend alpha global" name="" value="0x3" />
         <value caption="Blend alpha source" name="" value="0x2" />
         <value caption="Blend white" name="" value="0x1" />
         <value caption="Blend black" name="" value="0x0" />
      </value-group>
      <value-group caption="Destinary Blending Function bits" name="GLCDL1MODE__DESTBLEND">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Blend inverted destination" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Blend alpha destination" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Blend inverted source and inverted global" name="" value="0x7" />
         <value caption="Blend inverted global" name="" value="0x6" />
         <value caption="Blend inverted source" name="" value="0x5" />
         <value caption="Blend alpha source and alpha global" name="" value="0x4" />
         <value caption="Blend alpha global" name="" value="0x3" />
         <value caption="Blend alpha source" name="" value="0x2" />
         <value caption="Blend white" name="" value="0x1" />
         <value caption="Blend black" name="" value="0x0" />
      </value-group>
      <value-group caption="Premultiply Image Alpha bit" name="GLCDL1MODE__MULALPHA">
         <value caption="Premultiply image alpha is enabled" name="" value="0x1" />
         <value caption="Premultiply image alpha is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Force Alpha with Global Alpha bit" name="GLCDL1MODE__FORCEALPHA">
         <value caption="Force alpha with global alpha is enabled" name="" value="0x1" />
         <value caption="Force alpha with global alpha is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Disable Bilinear Filtering bit" name="GLCDL1MODE__DISABIFIL">
         <value caption="Bilinear filtering is enabled" name="" value="0x1" />
         <value caption="Bilinear filtering is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Layer Enable bit" name="GLCDL1MODE__LAYEREN">
         <value caption="Layer is enabled" name="" value="0x1" />
         <value caption="Layer is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Color Mode bits" name="GLCDL2MODE__COLORMODE">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="RGB888 color format" name="" value="0xb" />
         <value caption="YUYV color format" name="" value="0xa" />
         <value caption="L4 gray scale/palette format" name="" value="0x9" />
         <value caption="L1 gray scale/palette format" name="" value="0x8" />
         <value caption="L8 gray scale/palette format" name="" value="0x7" />
         <value caption="32-bit ARGB8888 color format" name="" value="0x6" />
         <value caption="16-bit RGB565 color format" name="" value="0x5" />
         <value caption="8-bit RGB332 color format" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="32-bit RGBA8888 color format" name="" value="0x2" />
         <value caption="16-bit RGBA5551 color format" name="" value="0x1" />
         <value caption="8-bit color palette look-up table (LUT8)" name="" value="0x0" />
      </value-group>
      <value-group caption="Source Blending Function bits" name="GLCDL2MODE__SRCBLEND">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Blend inverted destination" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Blend alpha destination" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Blend inverted source and inverted global" name="" value="0x7" />
         <value caption="Blend inverted global" name="" value="0x6" />
         <value caption="Blend inverted source" name="" value="0x5" />
         <value caption="Blend alpha source and alpha global" name="" value="0x4" />
         <value caption="Blend alpha global" name="" value="0x3" />
         <value caption="Blend alpha source" name="" value="0x2" />
         <value caption="Blend white" name="" value="0x1" />
         <value caption="Blend black" name="" value="0x0" />
      </value-group>
      <value-group caption="Destinary Blending Function bits" name="GLCDL2MODE__DESTBLEND">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Blend inverted destination" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Blend alpha destination" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Blend inverted source and inverted global" name="" value="0x7" />
         <value caption="Blend inverted global" name="" value="0x6" />
         <value caption="Blend inverted source" name="" value="0x5" />
         <value caption="Blend alpha source and alpha global" name="" value="0x4" />
         <value caption="Blend alpha global" name="" value="0x3" />
         <value caption="Blend alpha source" name="" value="0x2" />
         <value caption="Blend white" name="" value="0x1" />
         <value caption="Blend black" name="" value="0x0" />
      </value-group>
      <value-group caption="Premultiply Image Alpha bit" name="GLCDL2MODE__MULALPHA">
         <value caption="Premultiply image alpha is enabled" name="" value="0x1" />
         <value caption="Premultiply image alpha is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Force Alpha with Global Alpha bit" name="GLCDL2MODE__FORCEALPHA">
         <value caption="Force alpha with global alpha is enabled" name="" value="0x1" />
         <value caption="Force alpha with global alpha is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Disable Bilinear Filtering bit" name="GLCDL2MODE__DISABIFIL">
         <value caption="Bilinear filtering is enabled" name="" value="0x1" />
         <value caption="Bilinear filtering is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Layer Enable bit" name="GLCDL2MODE__LAYEREN">
         <value caption="Layer is enabled" name="" value="0x1" />
         <value caption="Layer is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="VSYNC Interrupt Enable bit" name="GLCDINT__VSYNCINT">
         <value caption="VSYNC interrupt is enabled" name="" value="0x1" />
         <value caption="VSYNC interrupt is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="IRQ Triggering Control bit" name="GLCDINT__IRQCON">
         <value caption="Edge triggering is enabled" name="" value="0x1" />
         <value caption="Level triggering is enabled" name="" value="0x0" />
      </value-group>
